package com.ddkj.buffalo.util.text;


public class DefineText {
    public static final String ExcelRemark = "支持大水牛Excel和通用Excel，将本程序放置在excel目录旁即可\n" +
            "第一个输入框为文件夹路径; 第二个搜索内容。" +
            "支持普通搜索、正则搜索(详情见功能说明)、\n范围搜索(*表示范围：“*”)。支持全局中文搜索(符号)，单击选项可编辑复制内容; 窗口可拉伸";
    public static final String RegexRemark =
            "create by xzb version1.0 2022-05-13\n\n" +
                    "活动翻译转换Java(双引号无效，请替换) 示例： img文件夹  本靓仔建议可以放置excel\n\n" +
                    "正则表达式(拉伸窗口查看内容)：\n" +
            "数字：^[0-9]*$\n" +
            "n位定长的数字：^\\d{n}$\n" +
            "m-n位之间的数字：^\\d{m,n}$\n" +
            "零和非零开头的数字：^(0|[1-9][0-9]*)$\n" +
            "非零开头的最多带两位小数的数字：^([1-9][0-9]*)+(.[0-9]{1,2})?$\n" +
            "带1-2位小数的正数或负数：^(\\-)?\\d+(\\.\\d{1,2})?$\n" +
            "正数、负数、和小数：^(\\-|\\+)?\\d+(\\.\\d+)?$\n" +
            "有两位小数的正实数：^[0-9]+(.[0-9]{2})?$\n" +
            "有1~3位小数的正实数：^[0-9]+(.[0-9]{1,3})?$\n" +
            "正整数：^\\d+$ 或 ^[1-9]\\d*|0$\n" +
            "负整数：^-[1-9]\\d*|0$ 或 ^((-\\d+)|(0+))$\n" +
            "正浮点数：^[1-9]\\d*\\.\\d*|0\\.\\d*[1-9]\\d*$ 或 ^(([0-9]+\\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\\.[0-9]+)|([0-9]*[1-9][0-9]*))$\n" +
            "负浮点数：^-([1-9]\\d*\\.\\d*|0\\.\\d*[1-9]\\d*)$ 或 ^(-(([0-9]+\\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\\.[0-9]+)|([0-9]*[1-9][0-9]*)))$\n" +
            "浮点数：^(-?\\d+)(\\.\\d+)?$ 或 ^-?([1-9]\\d*\\.\\d*|0\\.\\d*[1-9]\\d*|0?\\.0+|0)$\n" +
            "\n" +
            "汉字：^[\\u4e00-\\u9fa5]{0,}$\n" +
            "长度为3-20的所有字符：^.{3,20}$\n" +
            "由数字和26个英文字母组成的字符串：^[A-Za-z0-9]+$\n" +
            "由数字、26个英文字母或者下划线组成的字符串：^\\w+$ 或 ^\\w{3,20}$\n" +
            "中文、英文、数字包括下划线：^[\\u4E00-\\u9FA5A-Za-z0-9_]+$\n" +
            "中文、英文、数字但不包括下划线等符号：^[\\u4E00-\\u9FA5A-Za-z0-9]+$或 ^[\\u4E00-\\u9FA5A-Za-z0-9]{2,20}$\n" +
            "帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线)：^[a-zA-Z][a-zA-Z0-9_]{4,15}$\n" +
            "密码(以字母开头，长度在6~18之间，只能包含字母、数字和下划线)：^[a-zA-Z]\\w{5,17}$\n" +
            "强密码(必须包含大小写字母和数字的组合，不能使用特殊字符，长度在8-10之间)：^(?=.*\\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$\n" +
            "\n" +
            "Email地址：^\\w+([-+.]\\w+)*@\\w+([-.]\\w+)*\\.\\w+([-.]\\w+)*$\n" +
            "网站域名：[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(/.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+/.?\n" +
            "URL网址：^http://([\\w-]+\\.)+[\\w-]+(/[\\w-./?%&=]*)?$\n" +
            "手机号码：^(13[0-9]|17[0-9]|14[5|7]|15[0|1|2|3|5|6|7|8|9]|18[0|1|2|3|5|6|7|8|9])\\d{8}$\n" +
            "电话号码 (“XXX-XXXXXXX”、”XXXX-XXXXXXXX”、”XXX-XXXXXXX”、”XXX-XXXXXXXX”、”XXXXXXX”和”XXXXXXXX)：^(\\(\\d{3,4}-)|\\d{3.4}-)?\\d{7,8}$\n" +
            "国内电话号码(0511-4405222、021-87888822)：\\d{3}-\\d{8}|\\d{4}-\\d{7}\n" +
            "身份证号(15位、18位数字)：^\\d{15}|\\d{18}$\n" +
            "日期格式：^\\d{4}-\\d{1,2}-\\d{1,2}\n" +
            "一年的12个月(01～09和1～12)：^(0?[1-9]|1[0-2])$\n" +
            "一个月的31天(01～09和1～31)：^((0?[1-9])|((1|2)[0-9])|30|31)$\n" +
            "腾讯QQ号：[1-9][0-9]{4,8} (腾讯QQ号从10000开始，目前最长为10位)\n" +
            "中国邮政编码：[1-9]\\d{5}(?!\\d) (中国邮政编码为6位数字)\n" +
            "IP地址：\\d+\\.\\d+\\.\\d+\\.\\d+ (提取IP地址时有用)\n" +
            "IP地址：((?:(?:25[0-5]|2[0-4]\\\\d|[01]?\\\\d?\\\\d)\\\\.){3}(?:25[0-5]|2[0-4]\\\\d|[01]?\\\\d?\\\\d))";

}
